IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCRC0_MCRC0.xml
<module name="MCRC0_MCRC0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCRC0_CRC_CTRL0" acronym="MCRC0_CRC_CTRL0" offset="0x0" width="32" description="">
		<bitfield id="CH2_CRC_SEL2" width="1" begin="15" end="15" resetval="0x0" description="Refer 'CH2_DW_SEL' field description" range="15" rwaccess="RW"/> 
		<bitfield id="CH2_BYTE_SWAP" width="1" begin="14" end="14" resetval="0x0" description="BYTE SWAP Enable across Data Size0 ? Byte Swap Disabled1 ? Byte Swap enabled." range="14" rwaccess="RW"/> 
		<bitfield id="CH2_BIT_SWAP" width="1" begin="13" end="13" resetval="0x0" description="msb/lsb SWAPPING 0 ? msb (most significant bit First)1 ? lsb (least significant bit First)" range="13" rwaccess="RW"/> 
		<bitfield id="CH2_CRC_SEL" width="2" begin="12" end="11" resetval="0x0" description="CRC type select.  {CH1_CRC_SEL2,CH1_CRC_SEL[1:0]}000 ? CRC-64001 -  CRC-16010 ? CRC-32100 -  VDA CAN, SAE-J1850 CRC-8101 - H2F, Autosar 4.0110 - CASTAGNOLI, iSCSI111 / 011 - E2E Profile 4" range="12 - 11" rwaccess="RW"/> 
		<bitfield id="CH2_DW_SEL" width="2" begin="10" end="9" resetval="0x0" description="CRC Data Size select.000 ? 64 bit Data Size001 -  16 bit Data Size010 ? 32 Bit Data Size" range="10 - 9" rwaccess="RW"/> 
		<bitfield id="CH2_PSA_SWREST" width="1" begin="8" end="8" resetval="0x0" description="Channel 2 PSA Software Reset. When set, the PSA SignatureRegister is reset to all zero. Software reset does not reset softwarereset bit itself. Therefore, CPU is required to clear this bit by writinga ?0?.0 = PSA Signature Register not reset1 = PSA Signature Register reset" range="8" rwaccess="RW"/> 
		<bitfield id="CH1_CRC_SEL2" width="1" begin="7" end="7" resetval="0x0" description="Refer 'CH1_DW_SEL' field description" range="7" rwaccess="RW"/> 
		<bitfield id="CH1_BYTE_SWAP" width="1" begin="6" end="6" resetval="0x0" description="BYTE SWAP Enable across Data Size0 ? Byte Swap Disabled1 ? Byte Swap enabled." range="6" rwaccess="RW"/> 
		<bitfield id="CH1_BIT_SWAP" width="1" begin="5" end="5" resetval="0x0" description="msb/lsb SWAPPING 0 ? msb (most significant bit First)1 ? lsb (least significant bit First)" range="5" rwaccess="RW"/> 
		<bitfield id="CH1_CRC_SEL" width="2" begin="4" end="3" resetval="0x0" description="CRC type select.  {CH1_CRC_SEL2,CH1_CRC_SEL[1:0]}000 ? CRC-64001 -  CRC-16010 ? CRC-32100 -  VDA CAN, SAE-J1850 CRC-8101 - H2F, Autosar 4.0110 - CASTAGNOLI, iSCSI111 / 011 - E2E Profile 4" range="4 - 3" rwaccess="RW"/> 
		<bitfield id="CH1_DW_SEL" width="2" begin="2" end="1" resetval="0x0" description="CRC Data Size select.000 ? 64 bit Data Size001 -  16 bit Data Size010 ? 32 Bit Data Size" range="2 - 1" rwaccess="RW"/> 
		<bitfield id="CH1_PSA_SWREST" width="1" begin="0" end="0" resetval="0x0" description="Channel 1 PSA Software Reset. When set, the PSA SignatureRegister is reset to all zero. Software reset does not reset softwarereset bit itself. Therefore, CPU is required to clear this bit by writinga ?0?.0 = PSA Signature Register not reset1 = PSA Signature Register reset" range="0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_CTRL1" acronym="MCRC0_CRC_CTRL1" offset="0x8" width="32" description="">
		<bitfield id="RESERVED1" width="31" begin="31" end="1" resetval="0x0" description="Not Defined" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="PWDN" width="1" begin="0" end="0" resetval="0x0" description="Power Down. When set, MCRC moduleMCRC Module is put inpower down mode.0 = MCRC is not in power down mode1 = MCRC is in power down mode" range="0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_CTRL2" acronym="MCRC0_CRC_CTRL2" offset="0x10" width="32" description="">
		<bitfield id="RESERVED5" width="6" begin="31" end="26" resetval="0x0" description="Not Defined" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="RESERVED4" width="6" begin="23" end="18" resetval="0x0" description="Not Defined" range="23 - 18" rwaccess="RO"/> 
		<bitfield id="RESERVED3" width="6" begin="15" end="10" resetval="0x0" description="Not Defined" range="15 - 10" rwaccess="RO"/> 
		<bitfield id="CH2_MODE" width="2" begin="9" end="8" resetval="0x0" description="Channel 2 Mode:0 0 = Data Capture mode. In this mode, the PSA Signature Registerdoes not compress data when it is written. Any datawritten to PSA Signature Register is simply captured byPSA Signature Register without any compression. Thismode can be used to plant seed value into the PSA register0 1 = AUTO mode1 0 = reserved1 1 = Full-CPU mode" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="RESERVED2" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="CH1_TRACEEN" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 Data Trace Enable. When set, the channel is put intodata trace mode. The channel snoops on the CPU VBUSM,ITCM, DTCM buses for any read transaction. Any read data onthese buses is compressed by the PSA Signature Register. Whensuspend is on, the PSA Signature Register does not compress anyread data on these buses.0 = Data Trace disable1 = Data Trace enable" range="4" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="2" begin="3" end="2" resetval="0x0" description="Not Defined" range="3 - 2" rwaccess="RO"/> 
		<bitfield id="CH1_MODE" width="2" begin="1" end="0" resetval="0x0" description="Channel 1 Mode:0 0 = Data Capture mode. In this mode, the PSA Signature Registerdoes not compress data when it is written. Any datawritten to PSA Signature Register is simply captured byPSA Signature Register without any compression. Thismode can be used to plant seed value into the PSA register0 1 = AUTO mode1 0 = reserved1 1 = Full-CPU mode" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_INTS" acronym="MCRC0_CRC_INTS" offset="0x18" width="32" description="">
		<bitfield id="RESERVED5" width="3" begin="31" end="29" resetval="0x0" description="Not Defined" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="RESERVED4" width="4" begin="24" end="21" resetval="0x0" description="Not Defined" range="24 - 21" rwaccess="RO"/> 
		<bitfield id="RESERVED3" width="4" begin="16" end="13" resetval="0x0" description="Not Defined" range="16 - 13" rwaccess="RO"/> 
		<bitfield id="CH2_TIMEOUTENS" width="1" begin="12" end="12" resetval="0x0" description="Channel 2 Timeout Interrupt Enable Bit. Writing a one to thisbit enable the timeout interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Timeout Interrupt disable1 = Timeout Interrupt enableUser and privileged mode write:0 = Has no effect1 = Timeout Interrupt enable" range="12" rwaccess="RW"/> 
		<bitfield id="CH2_UNDERENS" width="1" begin="11" end="11" resetval="0x0" description="Channel 2 Underrun Interrupt Enable Bit. Writing a one tothis bit enable the underrun interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Underrun Interrupt disable1 = Underrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Underrun Interrupt enable" range="11" rwaccess="RW"/> 
		<bitfield id="CH2_OVERENS" width="1" begin="10" end="10" resetval="0x0" description="Channel 2 Overrun Interrupt Enable Bit. Writing a one to thisbit enable the overrun interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Overrun Interrupt disable1 = Overrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Overrun Interrupt enable" range="10" rwaccess="RW"/> 
		<bitfield id="CH2_CRCFAILENS" width="1" begin="9" end="9" resetval="0x0" description="Channel 2 CRC Fail Interrupt Enable Bit. Writing a one to thisbit enable the CRC fail interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = CRC Fail Interrupt disable1 = CRC Fail Interrupt enableUser and privileged mode write:0 = Has no effect1 = CRC Fail Interrupt enable" range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED2" width="4" begin="8" end="5" resetval="0x0" description="Not Defined" range="8 - 5" rwaccess="RO"/> 
		<bitfield id="CH1_TIMEOUTENS" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 Timeout Interrupt Enable Bit. Writing a one to thisbit enable the timeout interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Timeout Interrupt disable1 = Timeout Interrupt enableUser and privileged mode write:0 = Has no effect1 = Timeout Interrupt enable" range="4" rwaccess="RW"/> 
		<bitfield id="CH1_UNDERENS" width="1" begin="3" end="3" resetval="0x0" description="Channel 1 Underrun Interrupt Enable Bit. Writing a one tothis bit enable the underrun interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Underrun Interrupt disable1 = Underrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Underrun Interrupt enable" range="3" rwaccess="RW"/> 
		<bitfield id="CH1_OVERENS" width="1" begin="2" end="2" resetval="0x0" description="Channel 1 Overrun Interrupt Enable Bit. Writing a one to thisbit enable the overrun interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Overrun Interrupt disable1 = Overrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Overrun Interrupt enable" range="2" rwaccess="RW"/> 
		<bitfield id="CH1_CRCFAILENS" width="1" begin="1" end="1" resetval="0x0" description="Channel 1 CRC Fail Interrupt Enable Bit. Writing a one to thisbit enable the CRC fail interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = CRC Fail Interrupt disable1 = CRC Fail Interrupt enableUser and privileged mode write:0 = Has no effect1 = CRC Fail Interrupt enable" range="1" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="0" end="0" resetval="0x0" description="Not Defined" range="0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_INTR" acronym="MCRC0_CRC_INTR" offset="0x20" width="32" description="">
		<bitfield id="RESERVED5" width="3" begin="31" end="29" resetval="0x0" description="Not Defined" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="RESERVED4" width="4" begin="24" end="21" resetval="0x0" description="Not Defined" range="24 - 21" rwaccess="RO"/> 
		<bitfield id="RESERVED3" width="4" begin="16" end="13" resetval="0x0" description="Not Defined" range="16 - 13" rwaccess="RO"/> 
		<bitfield id="CH2_TIMEOUTENR" width="1" begin="12" end="12" resetval="0x0" description="Channel 2 Timeout Interrupt Disable Bit. Writing a one to thisbit disable the timeout interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Timeout Interrupt disable1 = Timeout Interrupt enableUser and privileged mode write:0 = Has no effect1 = Timeout Interrupt disable" range="12" rwaccess="RW"/> 
		<bitfield id="CH2_UNDERENR" width="1" begin="11" end="11" resetval="0x0" description="Channel 2 Underrun Interrupt Disable Bit. Writing a one tothis bit disable the underrun interrupt. Writing a zero has noeffect. Reading from this bit gives the status (interrupt enable/dis-able).User and privileged mode read:0 = Underrun Interrupt disable1 = Underrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Underrun Interrupt disable" range="11" rwaccess="RW"/> 
		<bitfield id="CH2_OVERENR" width="1" begin="10" end="10" resetval="0x0" description="Channel 2 Overrun Interrupt Disable Bit. Writing a one to thisbit disable the overrun interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Overrun Interrupt disable1 = Overrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Overrun Interrupt disable" range="10" rwaccess="RW"/> 
		<bitfield id="CH2_CRCFAILENR" width="1" begin="9" end="9" resetval="0x0" description="Channel 2 CRC Fail Interrupt Disable Bit. Writing a one to thisbit disable the CRC fail interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = CRC Fail Interrupt disable1 = CRC Fail Interrupt enableUser and privileged mode write:0 = Has no effect1 = CRC Fail Interrupt disable" range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED2" width="4" begin="8" end="5" resetval="0x0" description="Not Defined" range="8 - 5" rwaccess="RO"/> 
		<bitfield id="CH1_TIMEOUTENR" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 Timeout Interrupt Disable Bit. Writing a one to thisbit disable the timeout interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Timeout Interrupt disable1 = Timeout Interrupt enableUser and privileged mode write:0 = Has no effect1 = Timeout Interrupt disable" range="4" rwaccess="RW"/> 
		<bitfield id="CH1_UNDERENR" width="1" begin="3" end="3" resetval="0x0" description="Channel 1 Underrun Interrupt Disable Bit. Writing a one tothis bit disable the underrun interrupt. Writing a zero has noeffect. Reading from this bit gives the status (interrupt enable/dis-able).User and privileged mode read:0 = Underrun Interrupt disable1 = Underrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Underrun Interrupt disable" range="3" rwaccess="RW"/> 
		<bitfield id="CH1_OVERENR" width="1" begin="2" end="2" resetval="0x0" description="Channel 1 Overrun Interrupt Disable Bit. Writing a one to thisbit disable the overrun interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = Overrun Interrupt disable1 = Overrun Interrupt enableUser and privileged mode write:0 = Has no effect1 = Overrun Interrupt disable" range="2" rwaccess="RW"/> 
		<bitfield id="CH1_CRCFAILENR" width="1" begin="1" end="1" resetval="0x0" description="Channel 1 CRC Fail Interrupt Disable Bit. Writing a one to thisbit disable the CRC fail interrupt. Writing a zero has no effect.Reading from this bit gives the status (interrupt enable/disable).User and privileged mode read:0 = CRC Fail Interrupt disable1 = CRC Fail Interrupt enableUser and privileged mode write:0 = Has no effect1 = CRC Fail Interrupt disable" range="1" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="0" end="0" resetval="0x0" description="Not Defined" range="0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_STATUS_REG" acronym="MCRC0_CRC_STATUS_REG" offset="0x28" width="32" description="">
		<bitfield id="RESERVED5" width="3" begin="31" end="29" resetval="0x0" description="Not Defined" range="31 - 29" rwaccess="RO"/> 
		<bitfield id="RESERVED4" width="4" begin="24" end="21" resetval="0x0" description="Not Defined" range="24 - 21" rwaccess="RO"/> 
		<bitfield id="RESERVED3" width="4" begin="16" end="13" resetval="0x0" description="Not Defined" range="16 - 13" rwaccess="RO"/> 
		<bitfield id="CH2_TIMEOUT" width="1" begin="12" end="12" resetval="0x0" description="Channel 2 CRC Timeout Status Flag. This bit is cleared bywriting a ?1? to it only. Writing ?0? has no effect. This bit is set inAUTO mode.0 = No timeout interrupt is active1 = Timeout interrupt is active" range="12" rwaccess="RW"/> 
		<bitfield id="CH2_UNDER" width="1" begin="11" end="11" resetval="0x0" description="Channel 2 CRC Underrun Status Flag. This bit is cleared bywriting a ?1? to it only. Writing ?0? has no effect. This bit is set inAUTO mode only0 = No underrun interrupt is active1 = Underrun interrupt is active" range="11" rwaccess="RW"/> 
		<bitfield id="CH2_OVER" width="1" begin="10" end="10" resetval="0x0" description="Channel 2 CRC Overrun Status Flag. This bit is cleared bywriting a ?1? to it only. Writing ?0? has no effect. This bit is set inAUTO mode0 = No overrun interrupt is active1 = Overrun interrupt is active" range="10" rwaccess="RW"/> 
		<bitfield id="CH2_CRCFAIL" width="1" begin="9" end="9" resetval="0x0" description="Channel 2 CRC Compare Fail Status Flag. This bit is clearedby writing a ?1? to it only. Writing ?0? has no effect. This bit is setin AUTO mode only.0 = No CRC compare fail interrupt is active1 = CRC compare fail interrupt is active" range="9" rwaccess="RW"/> 
		<bitfield id="RESERVED2" width="4" begin="8" end="5" resetval="0x0" description="Not Defined" range="8 - 5" rwaccess="RO"/> 
		<bitfield id="CH1_TIMEOUT" width="1" begin="4" end="4" resetval="0x0" description="Channel 1 CRC Timeout Status Flag. This bit is cleared bywriting a ?1? to it only. Writing ?0? has no effect. This bit is set inAUTO mode.0 = No timeout interrupt is active1 = Timeout interrupt is active" range="4" rwaccess="RW"/> 
		<bitfield id="CH1_UNDER" width="1" begin="3" end="3" resetval="0x0" description="Channel 1 CRC Underrun Status Flag. This bit is cleared bywriting a ?1? to it only. Writing ?0? has no effect. This bit is set inAUTO mode only0 = No underrun interrupt is active1 = Underrun interrupt is active" range="3" rwaccess="RW"/> 
		<bitfield id="CH1_OVER" width="1" begin="2" end="2" resetval="0x0" description="Channel 1 CRC Overrun Status Flag. This bit is cleared bywriting a ?1? to it only. Writing ?0? has no effect. This bit is set inAUTO mode0 = No overrun interrupt is active1 = Overrun interrupt is active" range="2" rwaccess="RW"/> 
		<bitfield id="CH1_CRCFAIL" width="1" begin="1" end="1" resetval="0x0" description="Channel 1 CRC Compare Fail Status Flag. This bit is clearedby writing a ?1? to it only. Writing ?0? has no effect. This bit is setin AUTO mode only.0 = No CRC compare fail interrupt is active1 = CRC compare fail interrupt is active" range="1" rwaccess="RW"/> 
		<bitfield id="RESERVED1" width="1" begin="0" end="0" resetval="0x0" description="Not Defined" range="0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_INT_OFFSET_REG" acronym="MCRC0_CRC_INT_OFFSET_REG" offset="0x30" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="OFSTREG" width="8" begin="7" end="0" resetval="0x0" description="CRC Interrupt Offset. This register indicates the highest prioritypending interrupt vector address. Reading the offset register auto-matically clear the respective interrupt flag. Please referenceTable 1?3. for details." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_BUSY" acronym="MCRC0_CRC_BUSY" offset="0x38" width="32" description="">
		<bitfield id="RESERVED4" width="7" begin="31" end="25" resetval="0x0" description="Not Defined" range="31 - 25" rwaccess="RO"/> 
		<bitfield id="RESERVED3" width="7" begin="23" end="17" resetval="0x0" description="Not Defined" range="23 - 17" rwaccess="RO"/> 
		<bitfield id="RESERVED2" width="7" begin="15" end="9" resetval="0x0" description="Not Defined" range="15 - 9" rwaccess="RO"/> 
		<bitfield id="CH2_BUSY" width="1" begin="8" end="8" resetval="0x0" description="Ch2_BUSY. During AUTO mode, the busy flag is set when thefirst data pattern of the block is compressed and remains set untilthe the last data pattern of the block is compressed. The flag iscleared when the last data pattern of the block is compressed." range="8" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="7" begin="7" end="1" resetval="0x0" description="Not Defined" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="CH1_BUSY" width="1" begin="0" end="0" resetval="0x0" description="CH1_BUSY. During AUTO mode, the busy flag is set when thefirst data pattern of the block is compressed and remains set untilthe the last data pattern of the block is compressed. The flag iscleared when the last data pattern of the block is compressed." range="0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_PCOUNT_REG1" acronym="MCRC0_CRC_PCOUNT_REG1" offset="0x40" width="32" description="">
		<bitfield id="RESERVED1" width="12" begin="31" end="20" resetval="0x0" description="Not Defined" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="CRC_PAT_COUNT1" width="20" begin="19" end="0" resetval="0x0" description="Channel 1 Pattern Counter Preload Register. This register con-tains the number of data patterns in one sector to be compressedbefore a CRC is performed." range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_SCOUNT_REG1" acronym="MCRC0_CRC_SCOUNT_REG1" offset="0x44" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CRC_SEC_COUNT1" width="16" begin="15" end="0" resetval="0x0" description="Channel 1 Sector Counter Preload Register. This register con-tains the number of sectors in one block of memory." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_CURSEC_REG1" acronym="MCRC0_CRC_CURSEC_REG1" offset="0x48" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CRC_CURSEC1" width="16" begin="15" end="0" resetval="0x0" description="Channel 1 Current Sector ID Register. In AUTO mode, thisregister contains the current sector number of which the signatureverification fails. The sector counter is a free running up counter.When a sector fails, the erroneous sector number is logged intocurrent sector ID register and the CRC fail interrupt is generatedThe sector ID register is frozen until it is read and the CRC failstatus bit is cleared by CPU. While it is frozen, it does not captureanother erroneous sector number. When this condition happens,an overrun interrupt is generated instead. Once the register is readand the CRC fail interrupt flag is cleared it can capture new erro-neous sector number." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_WDTOPLD1" acronym="MCRC0_CRC_WDTOPLD1" offset="0x4C" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="CRC_WDTOPLD1" width="24" begin="23" end="0" resetval="0x0" description="Channel 1 Watchdog Timeout Counter Preload Register. Thisregister contains the number of clock cycles within which theDMA must transfer the next block of data patterns." range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_BCTOPLD1" acronym="MCRC0_CRC_BCTOPLD1" offset="0x50" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="CRC_BCTOPLD1" width="24" begin="23" end="0" resetval="0x0" description="Channel 1 Block Complete Timeout Counter Preload Regis-ter. This register contains the number of clock cycles withinwhich the CRC for an entire block needs to complete before atimeout interrupt is generated." range="23 - 0" rwaccess="RW"/>
	</register>
