IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCRC0_MCRC0.xml
	<register id="MCRC0_PSA_SIGREGL1" acronym="MCRC0_PSA_SIGREGL1" offset="0x60" width="32" description="">
		<bitfield id="PSASIG1_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Signature Low Register. This register containsthe value stored at PSASIG1[31:0] register." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_PSA_SIGREGH1" acronym="MCRC0_PSA_SIGREGH1" offset="0x64" width="32" description="">
		<bitfield id="PSA_SIG1_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Signature High Register. This register containsthe value stored at PSASIG1[63:32] register." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_REGL1" acronym="MCRC0_CRC_REGL1" offset="0x68" width="32" description="">
		<bitfield id="CRC1_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 CRC Value Low Register. This register contains thecurrent known good signature value stored at CRC1[31:0] regis-ter." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_REGH1" acronym="MCRC0_CRC_REGH1" offset="0x6C" width="32" description="">
		<bitfield id="CRC1_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 CRC Value High Register. This register contains thecurrent known good signature value stored at CRC1[63:32] regis-ter." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_PSA_SECSIGREGL1" acronym="MCRC0_PSA_SECSIGREGL1" offset="0x70" width="32" description="">
		<bitfield id="PSASECSIG1_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Sector Signature Low Register. This registercontains the value stored at PSASECSIG1[31:0] register." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_PSA_SECSIGREGH1" acronym="MCRC0_PSA_SECSIGREGH1" offset="0x74" width="32" description="">
		<bitfield id="PSASECSIG1_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 PSA Sector Signature High Register. This registercontains the value stored at PSASECSIG1[63:32] register." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_RAW_DATAREGL1" acronym="MCRC0_RAW_DATAREGL1" offset="0x78" width="32" description="">
		<bitfield id="RAW_DATA1_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 Raw Data Low Register. This register contains bit31:0 of the un-compressed raw data." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_RAW_DATAREGH1" acronym="MCRC0_RAW_DATAREGH1" offset="0x7C" width="32" description="">
		<bitfield id="RAW_DATA1_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 Raw Data High Register. This register contains bit63:32 of the un-compressed raw data." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_PCOUNT_REG2" acronym="MCRC0_CRC_PCOUNT_REG2" offset="0x80" width="32" description="">
		<bitfield id="RESERVED1" width="12" begin="31" end="20" resetval="0x0" description="Not Defined" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="CRC_PAT_COUNT2" width="20" begin="19" end="0" resetval="0x0" description="Channel 2 Pattern Counter Preload Register. This register con-tains the number of data patterns in one sector to be compressedbefore a CRC is performed." range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_SCOUNT_REG2" acronym="MCRC0_CRC_SCOUNT_REG2" offset="0x84" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CRC_SEC_COUNT2" width="16" begin="15" end="0" resetval="0x0" description="Channel 2 Sector Counter Preload Register. This register con-tains the number of sectors in one block of memory." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_CURSEC_REG2" acronym="MCRC0_CRC_CURSEC_REG2" offset="0x88" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CRC_CURSEC2" width="16" begin="15" end="0" resetval="0x0" description="Channel 2 Current Sector ID Register. In AUTO mode, thisregister contains the current sector number of which the signatureverification fails. The sector counter is a free running up counter.When a sector fails, the erroneous sector number is logged intocurrent sector ID register and the CRC fail interrupt is generatedThe sector ID register is frozen until it is read and the CRC failstatus bit is cleared by CPU. While it is frozen, it does not captureanother erroneous sector number. When this condition happens,an overrun interrupt is generated instead. Once the register is readand the CRC fail interrupt flag is cleared it can capture new erro-neous sector number." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_WDTOPLD2" acronym="MCRC0_CRC_WDTOPLD2" offset="0x8C" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="CRC_WDTOPLD2" width="24" begin="23" end="0" resetval="0x0" description="Channel 2 Watchdog Timeout Counter Preload Register. Thisregister contains the number of clock cycles within which theDMA must transfer the next block of data patterns." range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_BCTOPLD2" acronym="MCRC0_CRC_BCTOPLD2" offset="0x90" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="CRC_BCTOPLD2" width="24" begin="23" end="0" resetval="0x0" description="Channel 2 Block Complete Timeout Counter Preload Regis-ter. This register contains the number of clock cycles withinwhich the CRC for an entire block needs to complete before atimeout interrupt is generated." range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_PSA_SIGREGL2" acronym="MCRC0_PSA_SIGREGL2" offset="0xA0" width="32" description="">
		<bitfield id="PSASIG2_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Signature Low Register. This register containsthe value stored at PSASIG2[31:0] register." range="31 - 0" rwaccess="RW"/>
	</register>
