IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCRC0_MCRC0.xml
	<register id="MCRC0_PSA_SIGREGH2" acronym="MCRC0_PSA_SIGREGH2" offset="0xA4" width="32" description="">
		<bitfield id="PSA_SIG2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Signature High Register. This register containsthe value stored at PSASIG2[63:32] register." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_REGL2" acronym="MCRC0_CRC_REGL2" offset="0xA8" width="32" description="">
		<bitfield id="CRC2_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 CRC Value Low Register. This register contains thecurrent known good signature value stored at CRC2[31:0] regis-ter." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_CRC_REGH2" acronym="MCRC0_CRC_REGH2" offset="0xAC" width="32" description="">
		<bitfield id="CRC2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 CRC Value High Register. This register contains thecurrent known good signature value stored at CRC2[63:32] regis-ter." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_PSA_SECSIGREGL2" acronym="MCRC0_PSA_SECSIGREGL2" offset="0xB0" width="32" description="">
		<bitfield id="PSASECSIG2_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Sector Signature Low Register. This registercontains the value stored at PSASECSIG2[31:0] register." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_PSA_SECSIGREGH2" acronym="MCRC0_PSA_SECSIGREGH2" offset="0xB4" width="32" description="">
		<bitfield id="PSASECSIG2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 PSA Sector Signature High Register. This registercontains the value stored at PSASECSIG2[63:32] register." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_RAW_DATAREGL2" acronym="MCRC0_RAW_DATAREGL2" offset="0xB8" width="32" description="">
		<bitfield id="RAW_DATA2_31_0" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 Raw Data Low Register. This register contains bit31:0 of the un-compressed raw data." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_RAW_DATAREGH2" acronym="MCRC0_RAW_DATAREGH2" offset="0xBC" width="32" description="">
		<bitfield id="RAW_DATA2_63_32" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 Raw Data High Register. This register contains bit63:32 of the un-compressed raw data." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_PCOUNT_REG3" acronym="MCRC0_CRC_PCOUNT_REG3" offset="0xC0" width="32" description="">
		<bitfield id="RESERVED1" width="12" begin="31" end="20" resetval="0x0" description="Not Defined" range="31 - 20" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_SCOUNT_REG3" acronym="MCRC0_CRC_SCOUNT_REG3" offset="0xC4" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_CURSEC_REG3" acronym="MCRC0_CRC_CURSEC_REG3" offset="0xC8" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_WDTOPLD3" acronym="MCRC0_CRC_WDTOPLD3" offset="0xCC" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_BCTOPLD3" acronym="MCRC0_CRC_BCTOPLD3" offset="0xD0" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/>
	</register>
	<register id="MCRC0_PSA_SIGREGL3" acronym="MCRC0_PSA_SIGREGL3" offset="0xE0" width="32" description="">
		
	</register>
	<register id="MCRC0_PSA_SIGREGH3" acronym="MCRC0_PSA_SIGREGH3" offset="0xE4" width="32" description="">
		
	</register>
	<register id="MCRC0_CRC_REGL3" acronym="MCRC0_CRC_REGL3" offset="0xE8" width="32" description="">
		
	</register>
	<register id="MCRC0_CRC_REGH3" acronym="MCRC0_CRC_REGH3" offset="0xEC" width="32" description="">
		
	</register>
	<register id="MCRC0_PSA_SECSIGREGL3" acronym="MCRC0_PSA_SECSIGREGL3" offset="0xF0" width="32" description="">
		
	</register>
	<register id="MCRC0_PSA_SECSIGREGH3" acronym="MCRC0_PSA_SECSIGREGH3" offset="0xF4" width="32" description="">
		
	</register>
	<register id="MCRC0_RAW_DATAREGL3" acronym="MCRC0_RAW_DATAREGL3" offset="0xF8" width="32" description="">
		
	</register>
	<register id="MCRC0_RAW_DATAREGH3" acronym="MCRC0_RAW_DATAREGH3" offset="0xFC" width="32" description="">
		
	</register>
	<register id="MCRC0_CRC_PCOUNT_REG4" acronym="MCRC0_CRC_PCOUNT_REG4" offset="0x100" width="32" description="">
		<bitfield id="RESERVED1" width="12" begin="31" end="20" resetval="0x0" description="Not Defined" range="31 - 20" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_SCOUNT_REG4" acronym="MCRC0_CRC_SCOUNT_REG4" offset="0x104" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_CURSEC_REG4" acronym="MCRC0_CRC_CURSEC_REG4" offset="0x108" width="32" description="">
		<bitfield id="RESERVED1" width="16" begin="31" end="16" resetval="0x0" description="Not Defined" range="31 - 16" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_WDTOPLD4" acronym="MCRC0_CRC_WDTOPLD4" offset="0x10C" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/>
	</register>
	<register id="MCRC0_CRC_BCTOPLD4" acronym="MCRC0_CRC_BCTOPLD4" offset="0x110" width="32" description="">
		<bitfield id="RESERVED1" width="8" begin="31" end="24" resetval="0x0" description="Not Defined" range="31 - 24" rwaccess="RO"/>
	</register>
	<register id="MCRC0_PSA_SIGREGL4" acronym="MCRC0_PSA_SIGREGL4" offset="0x120" width="32" description="">
		
	</register>
	<register id="MCRC0_PSA_SIGREGH4" acronym="MCRC0_PSA_SIGREGH4" offset="0x124" width="32" description="">
		
	</register>
	<register id="MCRC0_CRC_REGL4" acronym="MCRC0_CRC_REGL4" offset="0x128" width="32" description="">
		
	</register>
	<register id="MCRC0_CRC_REGH4" acronym="MCRC0_CRC_REGH4" offset="0x12C" width="32" description="">
		
	</register>
	<register id="MCRC0_PSA_SECSIGREGL4" acronym="MCRC0_PSA_SECSIGREGL4" offset="0x130" width="32" description="">
		
	</register>
	<register id="MCRC0_PSA_SECSIGREGH4" acronym="MCRC0_PSA_SECSIGREGH4" offset="0x134" width="32" description="">
		
	</register>
	<register id="MCRC0_RAW_DATAREGL4" acronym="MCRC0_RAW_DATAREGL4" offset="0x138" width="32" description="">
		
	</register>
	<register id="MCRC0_RAW_DATAREGH4" acronym="MCRC0_RAW_DATAREGH4" offset="0x13C" width="32" description="">
		
	</register>
	<register id="MCRC0_MCRC_BUS_SEL" acronym="MCRC0_MCRC_BUS_SEL" offset="0x140" width="32" description="">
		<bitfield id="MEN" width="1" begin="2" end="2" resetval="0x1" description="MEn. Enable/disables the tracing of VBUSM 0: Tracing of VBUSM master bus has been disabled 1: Tracing of VBUSM master bus has been enabled" range="2" rwaccess="RW"/> 
		<bitfield id="DTCMEN" width="1" begin="1" end="1" resetval="0x1" description="DTCMEn. Enable/disables the tracing of data TCM0: Tracing of DTCM_ODD and DTCM_EVEN buses have been disabled1: Tracing of DTCM_ODD and DTCM_EVEN buses have been enabled" range="1" rwaccess="RW"/> 
		<bitfield id="ITCMEN" width="1" begin="0" end="0" resetval="0x1" description="ITCMEn. Enable/disables the tracing of instruction TCM 0: Tracing of ITCM bus has been disabled 1: Tracing of ITCM bus has been enabled" range="0" rwaccess="RW"/>
	</register>
	<register id="MCRC0_MCRC_RESERVED" acronym="MCRC0_MCRC_RESERVED" offset="0x144" width="32" description="">
		<bitfield id="NU68" width="32" begin="31" end="0" resetval="0x0" description="0x144 to 0x1FF is reserved area." range="31 - 0" rwaccess="RO"/>
	</register>
</module>